class Agreement {
  static String personalCollection = """
  # 개인정보 수집 및 이용 목적
- 회원 가입 및 관리: 회원 가입을 위한 본인 식별, 본인 확인, 회원자격 유지, 관리 및 부정 이용 방지
- 상담 및 서비스 제공: 서비스 이용 시 문의사항 또는 불만 처리, 서비스 제공, 제품 및 서비스의 배송 및 청구서 등 발송
- 마케팅 및 광고에 활용: 신규 서비스(제품) 개발 및 특화, 이벤트 및 광고성 정보 제공 및 참여 기회 제공
- 서비스 이용 기록과 접속 빈도 파악 또는 회원의 서비스 이용에 대한 통계

# 수집하는 개인정보의 항목
- 필수항목: 이름, 아이디, 비밀번호, 이메일 주소, 휴대폰 번호, 주소 등
- 선택항목: 성별, 생년월일, 관심분야, 서비스 이용 기록 등

# 개인정보의 보유 및 이용 기간
- 회원 탈퇴 또는 개인정보 삭제 요청 시까지 또는 회원 탈퇴 시 또는 개인정보 삭제 요청 시 지체 없이 파기

# 동의 거부 권리 및 동의 철회 방법
- 서비스 이용 도중 개인정보 수집에 대한 동의를 거부할 수 있습니다. 다만, 동의를 거부할 경우 일부 서비스 이용이 제한될 수 있습니다.
- 개인정보의 수집, 이용 및 제공에 대한 동의는 언제든지 철회 가능합니다. 동의 철회를 원할 경우 서비스 내 개인정보 관리 기능을 통해 직접 처리하거나, 문의하기 등의 방법으로 연락하여 동의 철회를 요청하십시오.

# 기타
- 기타 개인정보 처리와 관련한 사항은 개인정보 처리방침을 참고하시기 바랍니다.

""";
  static String personalUseage = """
  ## 개인정보 처리 동의서

안녕하세요. 저희는 어플회사(이하 "회사"라 함)에서 고객님의 개인정보를 중요시하며, 관련 법규를 준수하여 개인정보를 보호하고 있습니다. 이에 고객님께서는 아래의 개인정보 처리 동의에 동의해주시면 감사하겠습니다.

1. 수집하는 개인정보 항목
   - 성명: [성명 기재]
   - 연락처: [연락처 기재]
   - 주소: [주소 기재]
   - 이메일: [이메일 기재]
   - 기타: [필요한 경우 추가 정보 기재]

2. 개인정보의 수집 및 이용 목적
   - 회사는 수집한 개인정보를 다음 목적을 위해 이용합니다.
     - 서비스 제공을 위한 연락 및 안내
     - 서비스 이용에 따른 본인 인증
     - 고객 응대 및 문의 처리
     - 이벤트 및 프로모션 정보 제공

3. 개인정보의 보유 및 이용 기간
   - 개인정보는 수집 및 이용 목적이 달성된 후에는 지체 없이 파기됩니다. 단, 관련 법령에 따라 보존 기간이 정해져 있는 경우 해당 기간 동안 보관한 후 파기합니다.

4. 개인정보 제공 및 위탁
   - 회사는 고객님의 개인정보를 제3자에게 제공하거나 위탁하지 않습니다. 단, 관련 법령에 의해 요구되는 경우 또는 고객님의 동의가 있는 경우에만 제공될 수 있습니다.

5. 개인정보의 파기
   - 개인정보의 수집 및 이용 목적이 달성되거나 동의 철회 요청이 있을 경우, 회사는 지체 없이 해당 개인정보를 파기합니다. 파기 방법은 기록물 등에 대해서는 분쇄하거나 소각하며, 전자적 파일 형태로 저장된 개인정보는 기술적 방법을 통해 삭제합니다.

6. 개인정보 보호를 위한 노력
   - 회사는 개인정보보호법 등 관련 법규를 준수하며, 고객님의 개인정보를 최대한 안전하게 처리하기 위해 노력하고 있습니다.

7. 개인정보 관련 권리
   - 고객님은 언제든지 자신의 개인정보를 조회, 수정, 삭제할 수 있으며 개인정보 처리에 대한 동의를 철회할 수 있습니다. 해당 요청은 회사의 개인정보 관리 담당자에게 서면, 전화, 이메일 등을 통해 연락하여 할 수 있습니다.

위의 내용을 읽고 동의해주시면, 아래에 서명해주세요.

[ ] 개인정보 처리에 동의합니다.

서명: [고객 서명 또는 이름 기재]

날짜: [동의 일자]

""";
}
